import pandas as pd

print('----' * 30)
print('Табель учащихся в средней школе # 1285')

students = {
    'ID': ['01', '02', '03', '04', '05'],
    'Имя': ['Иван', 'Сергей', 'Екатерина', 'Ольга', 'Мария'],
    'Фамилия': ['Петров', 'Бойко', 'Литовченко', 'Мессинг', 'Пастернак'],
    'Дата рождения': ['17.08.1998', '24.07.1995', '21.04.1990', '23.09.1998', '08.01.1999'],
    'Успеваемость': ['Отличник', 'Троечник', 'Хорошист', 'Отличник', 'Хорошист']
}

sc = pd.DataFrame(students)

with open('students.csv', 'a', encoding='UTF-8') as cl:
    cl.write(f'{sc}')
    cl.write('\n')

print(sc)